## Pandas Day - 20

##  map() and applymap()
- **map()** is used for Series, while **applymap()** is used for element-wise operations on DataFrames.

In [9]:
import pandas as pd 
import warnings
warnings.filterwarnings('ignore')

In [4]:
df = pd.DataFrame({
    "Name": ["Amit", "Rahul", "Neha", "Priya"],
    "City": ["nagpur", "pune", "mumbai", "nagpur"],
    "Marks": [85, 78, 90, 88]
})

### map() on a Series

In [5]:
df["City"] = df["City"].map(str.upper)
df

    Name    City  Marks
0   Amit  NAGPUR     85
1  Rahul    PUNE     78
2   Neha  MUMBAI     90
3  Priya  NAGPUR     88

### map() using Dictionary

In [6]:
grade_map = {85: "A", 78: "B", 90: "A+", 88: "A"}
df["Grade"] = df["Marks"].map(grade_map)
df

    Name    City  Marks Grade
0   Amit  NAGPUR     85     A
1  Rahul    PUNE     78     B
2   Neha  MUMBAI     90    A+
3  Priya  NAGPUR     88     A

### applymap() on DataFrame

In [10]:
df_applymap = df[["Marks"]].applymap(lambda x: x + 2)
df_applymap

   Marks
0     87
1     80
2     92
3     90